import CentralShaheedMinar from '@/components/icons/CentralShaheedMinar.vue';
import Configuration from '@/components/icons/Configuration.vue';
import GeometricShapes from '@/components/icons/GeometricShapes.vue';
import Hierarchy from '@/components/icons/Hierarchy.vue';
import Lake from '@/components/icons/Lake.vue';
import Sofa from '@/components/icons/Sofa.vue';
import StarCircle from '@/components/icons/StarCircle.vue';
import image1 from '@/assets/images/IMG_3341.jpeg';
import image2 from '@/assets/images/IMG_3383.jpeg';
import image3 from '@/assets/images/IMG_3397.jpeg';
import image4 from '@/assets/images/IMG_3346.jpeg';
import engineering from '@/assets/images/IMG_3344.jpeg';
import design from '@/assets/images/IMG_3394.jpeg';
import construction from '@/assets/images/IMG_3384.jpeg';
import member1 from '@/assets/images/member1.png';
import member2 from '@/assets/images/member2.png';
import member3 from '@/assets/images/member3.png';
import member4 from '@/assets/images/member4.png';
import member5 from '@/assets/images/member5.png';
import member6 from '@/assets/images/member6.png';
import member7 from '@/assets/images/member7.png';
import project1 from '@/assets/images/IMG_3380.jpeg';
import project2 from '@/assets/images/IMG_3345.jpeg';
import project3 from '@/assets/images/IMG_3397.jpeg';
import image5 from '@/assets/images/IMG_3381.jpeg';

export const sliderHome = [image1, image2, image3, image4];

export const directions = [
  {
    title: 'Проектирование',
    image: engineering
  }, {
    title: 'Дизайн',
    image: design
  }, {
    title: 'Строительство',
    image: construction
  }
];

export const teamMembers = [
  {
		image: member1,
		name: 'Темирлан',
		position: 'Проектировщик'
	}, {
		image: member2,
		name: 'Марго',
		position: 'Дизайнер интерьера'
	}, {
		image: member3,
		name: 'Богдан',
		position: 'Инженер'
	}, {
		image: member4,
		name: 'Айгерим',
		position: '3Д Дизайнер'
	}, {
		image: member5,
		name: 'Айбек',
		position: 'Менеджер'
	}, {
		image: member6,
		name: 'Андрей',
		position: 'Дизайнер'
	}, {
		image: member7,
		name: 'Даурен',
		position: 'Дизайнер'
	}
];

export const faq = [
  {
    question: 'От скольких м² вы проектируете/строите дома',
    answer: ['Мы берем объекты в работу от 200 м²']
  }, {
    question: 'Какие сроки на проектирование',
    answer: ['От 1 до 3х месяцев']
  }, {
    question: 'Обязательно ли наличие земельного участка',
    answer: ['Да, обязательно']
  }, {
    question: 'Выезд на земельный участок бесплатный',
    answer: ['Да, выезд бесплатный. Выезд осуществляется архитектором и менеджером по продажам.']
  }, {
    question: 'Нужно ли разрешение на строительство частного дома/ввод в эксплуатацию',
    answer: ['Да, мы оказываем услугу на получение разрешительных документов. От замены целевого назначения до узаконения.']
  }, {
    question: 'Из каких этапов состоит проект',
    answer: [
      '1.	Выезд на земельный участок;',
      '2.	Разработка эскизного решение/концепт план;',
      '3.	Составление задания на проектирование;',
      '4.	Исходно-разрешительная документация;',
      '5.	Инженерные изыскания;',
      '6.	Разработка основных технических решений;',
      '7.	Разработка проектной документации;',
      '8.	Разработка рабочей документации;',
      '9.	Экспертиза;',
      ' ',
      'Согласование и экспертиза проектной и рабочей документации.'
    ]
  }, {
    question: 'Как вы работаете',
    answer: [
      '1.	Вы оставляете заявку в любое время;',
      '2.	Отдел продаж вас проконсультирует;',
      '3.	Выезд на земельный участок;',
      '4.	Заполняете анкету для составления технического задания;',
      '5.	Заключаем договор;',
      '6.	Приступаем к разработке эскизное решение/концепт плана;',
      '7.	Согласование/утверждение концепт плана;',
      '8.	Составление задания на проектирование;',
      '9.	Предоставление коммерческого предложение на проектирование с экспертизой/без экспертизы;',
      '10.	Заключение договора на проектирование.'
    ]
  }, {
    question: 'Обязательно ли заказывать проект у вас',
    answer: [
      'Не обязательно. Мы строим объекты и по готовым проектам. Для начала вы можете отправить готовый рабочий проект вашего объекта, мы вам посчитаем смету на строительство.'
    ]
  }
];

export const services = [
  {
    title: 'Архитектурное проектирование',
    text: 'Учитываем ваши потребности, эстетику и функциональность'
  }, {
    title: 'Инженерное проектирование',
    text: 'Обеспечиваем надёжность и безопасность вашего объекта'
  }, {
    title: 'Ландшафтное проектирование',
    text: 'Придаём окружающей среде красоту и гармонию'
  }, {
    title: 'Интерьерное проектирование',
    text: 'Создаём уют и стиль внутри помещений'
  }
];

export const servicesIcon = [CentralShaheedMinar, Configuration, Lake, Sofa];

export const advantages = [
  'Комплексный подход к созданию комфортной и функциональной среды, отвечающей потребностям и требованиям клиента.',
  'Учтены все детали, что позволяет максимально раскрыть потенциал помещения и обеспечить комфорт пользователей.',
  'Мы создаём уникальный стиль вашего пространства, соответствующий вашему видению, целям и ценностям.'
];

export const advantagesIcon = [Hierarchy, GeometricShapes, StarCircle];

export  const packages = [
  {
    title: 'Концепция',
    price: 'от 4 800 тг за м²',
    deadline: 'от 20 до 30 р/дн.',
    detail: [
      'План этажей и кровли',
      'Фасад и спецификация материалов к ним (2 варианта)',
      'Разрезы зданий (с предварительной планировкой)',
      'Визуализация фасада здания и сооружений (5–7 ракурсов)'
    ],
  }, {
    title: 'Дизайн',
    price: 'от 15 000 тг за м²',
    deadline: 'от 1 до 2 м',
    detail: [
      'Планировочное решение',
      'Визуализация',
      'Технический проект (рабочие чертежи)',
      'Спецификация',
      'Авторский надзор: от 300 000 тг в месяц'
    ],
  }, {
    title: 'Базовый',
    price: 'от 22 000 тг за м²',
    deadline: 'от 50 до 60 р/дн.',
    detail: [
      'План зданий и сооружений',
      'План этажей и кровли',
      'Кладочные планы, развёртки стен с вентканалами',
      'Разрезы, узлы фасадов',
      'Сведения и спецификации строительных материалов',
      'Визуализация фасада здания и сооружений (10 ракурсов)'
    ],
  }, {
    title: 'Расширенный',
    price: 'от 43 000 тг за м²',
    deadline: 'от 50 до 90 р/дн.',
    detail: [
      'Планировочное решение',
      'Визуализация',
      'Технический проект (рабочие чертежи)',
      'Спецификация',
      'Рабочие чертежи АР, КР, КЖ, ОВиК, ЭТР'
    ],
  }, {
    title: 'Комплексный',
    price: 'от 580 000 тг за м²',
    deadline: 'с даты подписания договора до въезда на, объект',
    detail: [
      'Пакет «Расширенный» + авторский надзор',
      'Выполнения всех строительных и ремонтных работ',
      'Управление строительством и ремонтом',
      'Финансовое планирование',
      'Организация поставок (закуп) всех строительных и ремонтных материалов'
    ],
  },
];

export const projects = [
  {
    id: 1,
    title: 'Название проекта',
    images: [project1, project1, project1, project1, project1],
    type: 'engineering',
    text: 'Мы не просто создаем чертежи и схемы. Мы исследуем, инновируем и воплощаем вашу концепцию в жизнь.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 2,
    title: 'Название проекта',
    images: [project2, project2, project2, project2, project2],
    type: 'design',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 3,
    title: 'Название проекта',
    images: [project3, project3, project3, project3, project3],
    type: 'construction',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 4,
    title: 'Название проекта',
    images: [project1, project1, project1, project1, project1],
    type: 'engineering',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 5,
    title: 'Название проекта',
    images: [project2, project2, project2, project2, project2],
    type: 'design',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 6,
    title: 'Название проекта',
    images: [project3, project3, project3, project3, project3],
    type: 'construction',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 7,
    title: 'Название проекта',
    images: [project1, project1, project1, project1, project1],
    type: 'engineering',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 8,
    title: 'Название проекта',
    images: [project2, project2, project2, project2, project2],
    type: 'design',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  },
  {
    id: 9,
    title: 'Название проекта',
    images: [project3, project3, project3, project3, project3],
    type: 'construction',
    text: 'Мы не просто создаем чертежи и схемы. Мы исследуем, инновируем и воплощаем вашу концепцию в жизнь.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 10,
    title: 'Название проекта',
    images: [project1, project1, project1, project1, project1],
    type: 'engineering',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 11,
    title: 'Название проекта',
    images: [project2, project2, project2, project2, project2],
    type: 'design',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 12,
    title: 'Название проекта',
    images: [project3, project3, project3, project3, project3],
    type: 'construction',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 13,
    title: 'Название проекта',
    images: [project1, project1, project1, project1, project1],
    type: 'engineering',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 14,
    title: 'Название проекта',
    images: [project2, project2, project2, project2, project2],
    type: 'design',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 15,
    title: 'Название проекта',
    images: [project3, project3, project3, project3, project3],
    type: 'construction',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 16,
    title: 'Название проекта',
    images: [project1, project1, project1, project1, project1],
    type: 'engineering',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 17,
    title: 'Название проекта',
    images: [project2, project2, project2, project2, project2],
    type: 'design',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 18,
    title: 'Название проекта',
    images: [project3, project3, project3, project3, project3],
    type: 'construction',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 19,
    title: 'Название проекта',
    images: [project1, project1, project1, project1, project1],
    type: 'engineering',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }, {
    id: 20,
    title: 'Название проекта',
    images: [project2, project2, project2, project2, project2],
    type: 'design',
    text: 'Внутрішній простір сповнений неймовірними можливостями, завдяки технології - Digital House. Ця технологія є однією з численних цікавинок, яка злагоджує зовнішній та внутрішній простір у єдину екосистему.<br><br>Усі технології керування будинком прихованні, тож ніщо не завадить насолоджуватися сучасним мінімалістичним стилем внутрішнього простору.',
    location: 'Казахстан, Алматы',
    area: '390 м²',
    deadline: '2 недели'
  }
];

export const statistics = [
  {
		text: 'лет опыта',
		counter: 12
	}, {
		text: 'довольных клиентов',
		counter: 120
	}, {
		text: 'проекта домов',
		counter: 72
	}, {
		text: 'дизайнов интерьера',
		counter: 48
	}
];

export const sliderAboutus = [image5, image5, image5, image5];

/*
consultation
Маска для форма
Отпарвка формы - sales@abigroup.kz
Добавить карту - https://www.google.com/maps/place/abigroup.kz/@43.2538326,76.9400809,17z/data=!3m1!4b1!4m6!3m5!1s0x3883694d05cff225:0x888cbb69cb939ce0!8m2!3d43.2538326!4d76.9400809!16s%2Fg%2F11nrxxw2pq?hl=ru&entry=ttu
adaptive check (main page/slider/content/text)
*/
